Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/ip1553.h
/*
 * Component description for IP1553
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-03-27T04:07:22Z */
#ifndef _SAMRH707_IP1553_COMPONENT_H_
#define _SAMRH707_IP1553_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR IP1553                                       */
/* ************************************************************************** */

/* -------- IP1553_CR : (IP1553 Offset: 0x00) (R/W 32) Configuration Register -------- */
#define IP1553_CR_PT_Pos                      _UINT32_(0)                                          /* (IP1553_CR) POTermConf Position */
#define IP1553_CR_PT_Msk                      (_UINT32_(0x1) << IP1553_CR_PT_Pos)                  /* (IP1553_CR) POTermConf Mask */
#define IP1553_CR_PT(value)                   (IP1553_CR_PT_Msk & (_UINT32_(value) << IP1553_CR_PT_Pos)) /* Assigment of value for PT in the IP1553_CR register */
#define IP1553_CR_TA_Pos                      _UINT32_(1)                                          /* (IP1553_CR) TermAddressConf Position */
#define IP1553_CR_TA_Msk                      (_UINT32_(0x1F) << IP1553_CR_TA_Pos)                 /* (IP1553_CR) TermAddressConf Mask */
#define IP1553_CR_TA(value)                   (IP1553_CR_TA_Msk & (_UINT32_(value) << IP1553_CR_TA_Pos)) /* Assigment of value for TA in the IP1553_CR register */
#define IP1553_CR_TC_Pos                      _UINT32_(6)                                          /* (IP1553_CR) TRBitCmd Position */
#define IP1553_CR_TC_Msk                      (_UINT32_(0x1) << IP1553_CR_TC_Pos)                  /* (IP1553_CR) TRBitCmd Mask */
#define IP1553_CR_TC(value)                   (IP1553_CR_TC_Msk & (_UINT32_(value) << IP1553_CR_TC_Pos)) /* Assigment of value for TC in the IP1553_CR register */
#define IP1553_CR_SC_Pos                      _UINT32_(7)                                          /* (IP1553_CR) SSBitCmd Position */
#define IP1553_CR_SC_Msk                      (_UINT32_(0x1) << IP1553_CR_SC_Pos)                  /* (IP1553_CR) SSBitCmd Mask */
#define IP1553_CR_SC(value)                   (IP1553_CR_SC_Msk & (_UINT32_(value) << IP1553_CR_SC_Pos)) /* Assigment of value for SC in the IP1553_CR register */
#define IP1553_CR_BC_Pos                      _UINT32_(8)                                          /* (IP1553_CR) BusyBitCmd Position */
#define IP1553_CR_BC_Msk                      (_UINT32_(0x1) << IP1553_CR_BC_Pos)                  /* (IP1553_CR) BusyBitCmd Mask */
#define IP1553_CR_BC(value)                   (IP1553_CR_BC_Msk & (_UINT32_(value) << IP1553_CR_BC_Pos)) /* Assigment of value for BC in the IP1553_CR register */
#define IP1553_CR_SRC_Pos                     _UINT32_(9)                                          /* (IP1553_CR) SREQBitCmd Position */
#define IP1553_CR_SRC_Msk                     (_UINT32_(0x1) << IP1553_CR_SRC_Pos)                 /* (IP1553_CR) SREQBitCmd Mask */
#define IP1553_CR_SRC(value)                  (IP1553_CR_SRC_Msk & (_UINT32_(value) << IP1553_CR_SRC_Pos)) /* Assigment of value for SRC in the IP1553_CR register */
#define IP1553_CR_BEC_Pos                     _UINT32_(10)                                         /* (IP1553_CR) BCEnableCmd Position */
#define IP1553_CR_BEC_Msk                     (_UINT32_(0x1) << IP1553_CR_BEC_Pos)                 /* (IP1553_CR) BCEnableCmd Mask */
#define IP1553_CR_BEC(value)                  (IP1553_CR_BEC_Msk & (_UINT32_(value) << IP1553_CR_BEC_Pos)) /* Assigment of value for BEC in the IP1553_CR register */
#define IP1553_CR_RST_Pos                     _UINT32_(11)                                         /* (IP1553_CR) Soft Reset Position */
#define IP1553_CR_RST_Msk                     (_UINT32_(0x1) << IP1553_CR_RST_Pos)                 /* (IP1553_CR) Soft Reset Mask */
#define IP1553_CR_RST(value)                  (IP1553_CR_RST_Msk & (_UINT32_(value) << IP1553_CR_RST_Pos)) /* Assigment of value for RST in the IP1553_CR register */
#define IP1553_CR_Msk                         _UINT32_(0x00000FFF)                                 /* (IP1553_CR) Register Mask  */


/* -------- IP1553_CMDR1 : (IP1553 Offset: 0x0C) ( /W 32) Command Register 1 -------- */
#define IP1553_CMDR1_DATAWORDCOUNT_Pos        _UINT32_(0)                                          /* (IP1553_CMDR1) DATA WORD COUNT Position */
#define IP1553_CMDR1_DATAWORDCOUNT_Msk        (_UINT32_(0x1F) << IP1553_CMDR1_DATAWORDCOUNT_Pos)   /* (IP1553_CMDR1) DATA WORD COUNT Mask */
#define IP1553_CMDR1_DATAWORDCOUNT(value)     (IP1553_CMDR1_DATAWORDCOUNT_Msk & (_UINT32_(value) << IP1553_CMDR1_DATAWORDCOUNT_Pos)) /* Assigment of value for DATAWORDCOUNT in the IP1553_CMDR1 register */
#define IP1553_CMDR1_RTSUBADDRESS_Pos         _UINT32_(5)                                          /* (IP1553_CMDR1) RT SUBADDRESS Position */
#define IP1553_CMDR1_RTSUBADDRESS_Msk         (_UINT32_(0x1F) << IP1553_CMDR1_RTSUBADDRESS_Pos)    /* (IP1553_CMDR1) RT SUBADDRESS Mask */
#define IP1553_CMDR1_RTSUBADDRESS(value)      (IP1553_CMDR1_RTSUBADDRESS_Msk & (_UINT32_(value) << IP1553_CMDR1_RTSUBADDRESS_Pos)) /* Assigment of value for RTSUBADDRESS in the IP1553_CMDR1 register */
#define IP1553_CMDR1_T_R_Pos                  _UINT32_(10)                                         /* (IP1553_CMDR1) T/R Position */
#define IP1553_CMDR1_T_R_Msk                  (_UINT32_(0x1) << IP1553_CMDR1_T_R_Pos)              /* (IP1553_CMDR1) T/R Mask */
#define IP1553_CMDR1_T_R(value)               (IP1553_CMDR1_T_R_Msk & (_UINT32_(value) << IP1553_CMDR1_T_R_Pos)) /* Assigment of value for T_R in the IP1553_CMDR1 register */
#define IP1553_CMDR1_RTADDRESS_Pos            _UINT32_(11)                                         /* (IP1553_CMDR1) RT ADDRESS Position */
#define IP1553_CMDR1_RTADDRESS_Msk            (_UINT32_(0x1F) << IP1553_CMDR1_RTADDRESS_Pos)       /* (IP1553_CMDR1) RT ADDRESS Mask */
#define IP1553_CMDR1_RTADDRESS(value)         (IP1553_CMDR1_RTADDRESS_Msk & (_UINT32_(value) << IP1553_CMDR1_RTADDRESS_Pos)) /* Assigment of value for RTADDRESS in the IP1553_CMDR1 register */
#define IP1553_CMDR1_Msk                      _UINT32_(0x0000FFFF)                                 /* (IP1553_CMDR1) Register Mask  */


/* -------- IP1553_CMDR2 : (IP1553 Offset: 0x10) ( /W 32) Command Register 2 -------- */
#define IP1553_CMDR2_DATAWORDCOUNT_Pos        _UINT32_(0)                                          /* (IP1553_CMDR2) DATA WORD COUNT Position */
#define IP1553_CMDR2_DATAWORDCOUNT_Msk        (_UINT32_(0x1F) << IP1553_CMDR2_DATAWORDCOUNT_Pos)   /* (IP1553_CMDR2) DATA WORD COUNT Mask */
#define IP1553_CMDR2_DATAWORDCOUNT(value)     (IP1553_CMDR2_DATAWORDCOUNT_Msk & (_UINT32_(value) << IP1553_CMDR2_DATAWORDCOUNT_Pos)) /* Assigment of value for DATAWORDCOUNT in the IP1553_CMDR2 register */
#define IP1553_CMDR2_RTSUBADDRESS_Pos         _UINT32_(5)                                          /* (IP1553_CMDR2) RT SUBADDRESS Position */
#define IP1553_CMDR2_RTSUBADDRESS_Msk         (_UINT32_(0x1F) << IP1553_CMDR2_RTSUBADDRESS_Pos)    /* (IP1553_CMDR2) RT SUBADDRESS Mask */
#define IP1553_CMDR2_RTSUBADDRESS(value)      (IP1553_CMDR2_RTSUBADDRESS_Msk & (_UINT32_(value) << IP1553_CMDR2_RTSUBADDRESS_Pos)) /* Assigment of value for RTSUBADDRESS in the IP1553_CMDR2 register */
#define IP1553_CMDR2_T_R_Pos                  _UINT32_(10)                                         /* (IP1553_CMDR2) R/T Position */
#define IP1553_CMDR2_T_R_Msk                  (_UINT32_(0x1) << IP1553_CMDR2_T_R_Pos)              /* (IP1553_CMDR2) R/T Mask */
#define IP1553_CMDR2_T_R(value)               (IP1553_CMDR2_T_R_Msk & (_UINT32_(value) << IP1553_CMDR2_T_R_Pos)) /* Assigment of value for T_R in the IP1553_CMDR2 register */
#define IP1553_CMDR2_RTADDRESS_Pos            _UINT32_(11)                                         /* (IP1553_CMDR2) RT ADDRESS Position */
#define IP1553_CMDR2_RTADDRESS_Msk            (_UINT32_(0x1F) << IP1553_CMDR2_RTADDRESS_Pos)       /* (IP1553_CMDR2) RT ADDRESS Mask */
#define IP1553_CMDR2_RTADDRESS(value)         (IP1553_CMDR2_RTADDRESS_Msk & (_UINT32_(value) << IP1553_CMDR2_RTADDRESS_Pos)) /* Assigment of value for RTADDRESS in the IP1553_CMDR2 register */
#define IP1553_CMDR2_Msk                      _UINT32_(0x0000FFFF)                                 /* (IP1553_CMDR2) Register Mask  */


/* -------- IP1553_CMDR3 : (IP1553 Offset: 0x14) ( /W 32) Command Register 3 -------- */
#define IP1553_CMDR3_BUS_Pos                  _UINT32_(0)                                          /* (IP1553_CMDR3) bus used Position */
#define IP1553_CMDR3_BUS_Msk                  (_UINT32_(0x1) << IP1553_CMDR3_BUS_Pos)              /* (IP1553_CMDR3) bus used Mask */
#define IP1553_CMDR3_BUS(value)               (IP1553_CMDR3_BUS_Msk & (_UINT32_(value) << IP1553_CMDR3_BUS_Pos)) /* Assigment of value for BUS in the IP1553_CMDR3 register */
#define IP1553_CMDR3_BCE_Pos                  _UINT32_(1)                                          /* (IP1553_CMDR3) 1553 emitter Position */
#define IP1553_CMDR3_BCE_Msk                  (_UINT32_(0x1) << IP1553_CMDR3_BCE_Pos)              /* (IP1553_CMDR3) 1553 emitter Mask */
#define IP1553_CMDR3_BCE(value)               (IP1553_CMDR3_BCE_Msk & (_UINT32_(value) << IP1553_CMDR3_BCE_Pos)) /* Assigment of value for BCE in the IP1553_CMDR3 register */
#define IP1553_CMDR3_BCR_Pos                  _UINT32_(2)                                          /* (IP1553_CMDR3) 1553 receiver Position */
#define IP1553_CMDR3_BCR_Msk                  (_UINT32_(0x1) << IP1553_CMDR3_BCR_Pos)              /* (IP1553_CMDR3) 1553 receiver Mask */
#define IP1553_CMDR3_BCR(value)               (IP1553_CMDR3_BCR_Msk & (_UINT32_(value) << IP1553_CMDR3_BCR_Pos)) /* Assigment of value for BCR in the IP1553_CMDR3 register */
#define IP1553_CMDR3_ER_Pos                   _UINT32_(3)                                          /* (IP1553_CMDR3) data or command transfer Position */
#define IP1553_CMDR3_ER_Msk                   (_UINT32_(0x1) << IP1553_CMDR3_ER_Pos)               /* (IP1553_CMDR3) data or command transfer Mask */
#define IP1553_CMDR3_ER(value)                (IP1553_CMDR3_ER_Msk & (_UINT32_(value) << IP1553_CMDR3_ER_Pos)) /* Assigment of value for ER in the IP1553_CMDR3 register */
#define IP1553_CMDR3_Msk                      _UINT32_(0x0000000F)                                 /* (IP1553_CMDR3) Register Mask  */


/* -------- IP1553_BITR : (IP1553 Offset: 0x18) ( /W 32) BIT Register -------- */
#define IP1553_BITR_TOBITWORD_Pos             _UINT32_(0)                                          /* (IP1553_BITR) to bit word Position */
#define IP1553_BITR_TOBITWORD_Msk             (_UINT32_(0xFFFF) << IP1553_BITR_TOBITWORD_Pos)      /* (IP1553_BITR) to bit word Mask */
#define IP1553_BITR_TOBITWORD(value)          (IP1553_BITR_TOBITWORD_Msk & (_UINT32_(value) << IP1553_BITR_TOBITWORD_Pos)) /* Assigment of value for TOBITWORD in the IP1553_BITR register */
#define IP1553_BITR_Msk                       _UINT32_(0x0000FFFF)                                 /* (IP1553_BITR) Register Mask  */


/* -------- IP1553_VWR : (IP1553 Offset: 0x1C) ( /W 32) Vector Word Register -------- */
#define IP1553_VWR_TOVECTORWORD_Pos           _UINT32_(0)                                          /* (IP1553_VWR) to vector word Position */
#define IP1553_VWR_TOVECTORWORD_Msk           (_UINT32_(0xFFFF) << IP1553_VWR_TOVECTORWORD_Pos)    /* (IP1553_VWR) to vector word Mask */
#define IP1553_VWR_TOVECTORWORD(value)        (IP1553_VWR_TOVECTORWORD_Msk & (_UINT32_(value) << IP1553_VWR_TOVECTORWORD_Pos)) /* Assigment of value for TOVECTORWORD in the IP1553_VWR register */
#define IP1553_VWR_Msk                        _UINT32_(0x0000FFFF)                                 /* (IP1553_VWR) Register Mask  */


