Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/ip1553.h
/* -------- IP1553_IER : (IP1553 Offset: 0x20) ( /W 32) IRQ Mask Enable Register -------- */
#define IP1553_IER_EMT_Pos                    _UINT32_(0)                                          /* (IP1553_IER) EndMemTransfer Position */
#define IP1553_IER_EMT_Msk                    (_UINT32_(0x1) << IP1553_IER_EMT_Pos)                /* (IP1553_IER) EndMemTransfer Mask */
#define IP1553_IER_EMT(value)                 (IP1553_IER_EMT_Msk & (_UINT32_(value) << IP1553_IER_EMT_Pos)) /* Assigment of value for EMT in the IP1553_IER register */
#define IP1553_IER_MTE_Pos                    _UINT32_(1)                                          /* (IP1553_IER) MemTransferErr Position */
#define IP1553_IER_MTE_Msk                    (_UINT32_(0x1) << IP1553_IER_MTE_Pos)                /* (IP1553_IER) MemTransferErr Mask */
#define IP1553_IER_MTE(value)                 (IP1553_IER_MTE_Msk & (_UINT32_(value) << IP1553_IER_MTE_Pos)) /* Assigment of value for MTE in the IP1553_IER register */
#define IP1553_IER_ERX_Pos                    _UINT32_(2)                                          /* (IP1553_IER) End reception Position */
#define IP1553_IER_ERX_Msk                    (_UINT32_(0x1) << IP1553_IER_ERX_Pos)                /* (IP1553_IER) End reception Mask */
#define IP1553_IER_ERX(value)                 (IP1553_IER_ERX_Msk & (_UINT32_(value) << IP1553_IER_ERX_Pos)) /* Assigment of value for ERX in the IP1553_IER register */
#define IP1553_IER_ETX_Pos                    _UINT32_(3)                                          /* (IP1553_IER) EndTransmission Position */
#define IP1553_IER_ETX_Msk                    (_UINT32_(0x1) << IP1553_IER_ETX_Pos)                /* (IP1553_IER) EndTransmission Mask */
#define IP1553_IER_ETX(value)                 (IP1553_IER_ETX_Msk & (_UINT32_(value) << IP1553_IER_ETX_Pos)) /* Assigment of value for ETX in the IP1553_IER register */
#define IP1553_IER_ETRANS_Pos                 _UINT32_(4)                                          /* (IP1553_IER) EndTransfer Position */
#define IP1553_IER_ETRANS_Msk                 (_UINT32_(0x3) << IP1553_IER_ETRANS_Pos)             /* (IP1553_IER) EndTransfer Mask */
#define IP1553_IER_ETRANS(value)              (IP1553_IER_ETRANS_Msk & (_UINT32_(value) << IP1553_IER_ETRANS_Pos)) /* Assigment of value for ETRANS in the IP1553_IER register */
#define IP1553_IER_TE_Pos                     _UINT32_(6)                                          /* (IP1553_IER) TransErr Position */
#define IP1553_IER_TE_Msk                     (_UINT32_(0x1) << IP1553_IER_TE_Pos)                 /* (IP1553_IER) TransErr Mask */
#define IP1553_IER_TE(value)                  (IP1553_IER_TE_Msk & (_UINT32_(value) << IP1553_IER_TE_Pos)) /* Assigment of value for TE in the IP1553_IER register */
#define IP1553_IER_TCE_Pos                    _UINT32_(7)                                          /* (IP1553_IER) TransCodingErr Position */
#define IP1553_IER_TCE_Msk                    (_UINT32_(0x1) << IP1553_IER_TCE_Pos)                /* (IP1553_IER) TransCodingErr Mask */
#define IP1553_IER_TCE(value)                 (IP1553_IER_TCE_Msk & (_UINT32_(value) << IP1553_IER_TCE_Pos)) /* Assigment of value for TCE in the IP1553_IER register */
#define IP1553_IER_TPE_Pos                    _UINT32_(8)                                          /* (IP1553_IER) TransParityErr Position */
#define IP1553_IER_TPE_Msk                    (_UINT32_(0x1) << IP1553_IER_TPE_Pos)                /* (IP1553_IER) TransParityErr Mask */
#define IP1553_IER_TPE(value)                 (IP1553_IER_TPE_Msk & (_UINT32_(value) << IP1553_IER_TPE_Pos)) /* Assigment of value for TPE in the IP1553_IER register */
#define IP1553_IER_TDE_Pos                    _UINT32_(9)                                          /* (IP1553_IER) TransDataTypeErr Position */
#define IP1553_IER_TDE_Msk                    (_UINT32_(0x1) << IP1553_IER_TDE_Pos)                /* (IP1553_IER) TransDataTypeErr Mask */
#define IP1553_IER_TDE(value)                 (IP1553_IER_TDE_Msk & (_UINT32_(value) << IP1553_IER_TDE_Pos)) /* Assigment of value for TDE in the IP1553_IER register */
#define IP1553_IER_TTE_Pos                    _UINT32_(10)                                         /* (IP1553_IER) TransTimeOutErr Position */
#define IP1553_IER_TTE_Msk                    (_UINT32_(0x1) << IP1553_IER_TTE_Pos)                /* (IP1553_IER) TransTimeOutErr Mask */
#define IP1553_IER_TTE(value)                 (IP1553_IER_TTE_Msk & (_UINT32_(value) << IP1553_IER_TTE_Pos)) /* Assigment of value for TTE in the IP1553_IER register */
#define IP1553_IER_TWE_Pos                    _UINT32_(11)                                         /* (IP1553_IER) TransWordCounterErr Position */
#define IP1553_IER_TWE_Msk                    (_UINT32_(0x1) << IP1553_IER_TWE_Pos)                /* (IP1553_IER) TransWordCounterErr Mask */
#define IP1553_IER_TWE(value)                 (IP1553_IER_TWE_Msk & (_UINT32_(value) << IP1553_IER_TWE_Pos)) /* Assigment of value for TWE in the IP1553_IER register */
#define IP1553_IER_BE_Pos                     _UINT32_(12)                                         /* (IP1553_IER) BufIFErr Position */
#define IP1553_IER_BE_Msk                     (_UINT32_(0x1) << IP1553_IER_BE_Pos)                 /* (IP1553_IER) BufIFErr Mask */
#define IP1553_IER_BE(value)                  (IP1553_IER_BE_Msk & (_UINT32_(value) << IP1553_IER_BE_Pos)) /* Assigment of value for BE in the IP1553_IER register */
#define IP1553_IER_ITR_Pos                    _UINT32_(13)                                         /* (IP1553_IER) IllegalTransferReq Position */
#define IP1553_IER_ITR_Msk                    (_UINT32_(0x1) << IP1553_IER_ITR_Pos)                /* (IP1553_IER) IllegalTransferReq Mask */
#define IP1553_IER_ITR(value)                 (IP1553_IER_ITR_Msk & (_UINT32_(value) << IP1553_IER_ITR_Pos)) /* Assigment of value for ITR in the IP1553_IER register */
#define IP1553_IER_TVR_Pos                    _UINT32_(14)                                         /* (IP1553_IER) TransVecWordReq Position */
#define IP1553_IER_TVR_Msk                    (_UINT32_(0x1) << IP1553_IER_TVR_Pos)                /* (IP1553_IER) TransVecWordReq Mask */
#define IP1553_IER_TVR(value)                 (IP1553_IER_TVR_Msk & (_UINT32_(value) << IP1553_IER_TVR_Pos)) /* Assigment of value for TVR in the IP1553_IER register */
#define IP1553_IER_DBR_Pos                    _UINT32_(15)                                         /* (IP1553_IER) DynamicBusContReq Position */
#define IP1553_IER_DBR_Msk                    (_UINT32_(0x1) << IP1553_IER_DBR_Pos)                /* (IP1553_IER) DynamicBusContReq Mask */
#define IP1553_IER_DBR(value)                 (IP1553_IER_DBR_Msk & (_UINT32_(value) << IP1553_IER_DBR_Pos)) /* Assigment of value for DBR in the IP1553_IER register */
#define IP1553_IER_STR_Pos                    _UINT32_(16)                                         /* (IP1553_IER) InitSelfTestReq Position */
#define IP1553_IER_STR_Msk                    (_UINT32_(0x1) << IP1553_IER_STR_Pos)                /* (IP1553_IER) InitSelfTestReq Mask */
#define IP1553_IER_STR(value)                 (IP1553_IER_STR_Msk & (_UINT32_(value) << IP1553_IER_STR_Pos)) /* Assigment of value for STR in the IP1553_IER register */
#define IP1553_IER_TSR_Pos                    _UINT32_(17)                                         /* (IP1553_IER) TranShutdownReq Position */
#define IP1553_IER_TSR_Msk                    (_UINT32_(0x1) << IP1553_IER_TSR_Pos)                /* (IP1553_IER) TranShutdownReq Mask */
#define IP1553_IER_TSR(value)                 (IP1553_IER_TSR_Msk & (_UINT32_(value) << IP1553_IER_TSR_Pos)) /* Assigment of value for TSR in the IP1553_IER register */
#define IP1553_IER_OSR_Pos                    _UINT32_(18)                                         /* (IP1553_IER) OvTranShutdownReq Position */
#define IP1553_IER_OSR_Msk                    (_UINT32_(0x1) << IP1553_IER_OSR_Pos)                /* (IP1553_IER) OvTranShutdownReq Mask */
#define IP1553_IER_OSR(value)                 (IP1553_IER_OSR_Msk & (_UINT32_(value) << IP1553_IER_OSR_Pos)) /* Assigment of value for OSR in the IP1553_IER register */
#define IP1553_IER_SDR_Pos                    _UINT32_(19)                                         /* (IP1553_IER) SyncWithDataReq Position */
#define IP1553_IER_SDR_Msk                    (_UINT32_(0x1) << IP1553_IER_SDR_Pos)                /* (IP1553_IER) SyncWithDataReq Mask */
#define IP1553_IER_SDR(value)                 (IP1553_IER_SDR_Msk & (_UINT32_(value) << IP1553_IER_SDR_Pos)) /* Assigment of value for SDR in the IP1553_IER register */
#define IP1553_IER_SWD_Pos                    _UINT32_(20)                                         /* (IP1553_IER) SyncWithoutDataReq Position */
#define IP1553_IER_SWD_Msk                    (_UINT32_(0x1) << IP1553_IER_SWD_Pos)                /* (IP1553_IER) SyncWithoutDataReq Mask */
#define IP1553_IER_SWD(value)                 (IP1553_IER_SWD_Msk & (_UINT32_(value) << IP1553_IER_SWD_Pos)) /* Assigment of value for SWD in the IP1553_IER register */
#define IP1553_IER_RRT_Pos                    _UINT32_(21)                                         /* (IP1553_IER) ResetRTReq Position */
#define IP1553_IER_RRT_Msk                    (_UINT32_(0x1) << IP1553_IER_RRT_Pos)                /* (IP1553_IER) ResetRTReq Mask */
#define IP1553_IER_RRT(value)                 (IP1553_IER_RRT_Msk & (_UINT32_(value) << IP1553_IER_RRT_Pos)) /* Assigment of value for RRT in the IP1553_IER register */
#define IP1553_IER_ITF_Pos                    _UINT32_(22)                                         /* (IP1553_IER) InhibitTermFlagReq Position */
#define IP1553_IER_ITF_Msk                    (_UINT32_(0x1) << IP1553_IER_ITF_Pos)                /* (IP1553_IER) InhibitTermFlagReq Mask */
#define IP1553_IER_ITF(value)                 (IP1553_IER_ITF_Msk & (_UINT32_(value) << IP1553_IER_ITF_Pos)) /* Assigment of value for ITF in the IP1553_IER register */
#define IP1553_IER_OTF_Pos                    _UINT32_(23)                                         /* (IP1553_IER) OvInhibitTermFlagReq Position */
#define IP1553_IER_OTF_Msk                    (_UINT32_(0x1) << IP1553_IER_OTF_Pos)                /* (IP1553_IER) OvInhibitTermFlagReq Mask */
#define IP1553_IER_OTF(value)                 (IP1553_IER_OTF_Msk & (_UINT32_(value) << IP1553_IER_OTF_Pos)) /* Assigment of value for OTF in the IP1553_IER register */
#define IP1553_IER_IPB_Pos                    _UINT32_(24)                                         /* (IP1553_IER) IPBusy Position */
#define IP1553_IER_IPB_Msk                    (_UINT32_(0x1) << IP1553_IER_IPB_Pos)                /* (IP1553_IER) IPBusy Mask */
#define IP1553_IER_IPB(value)                 (IP1553_IER_IPB_Msk & (_UINT32_(value) << IP1553_IER_IPB_Pos)) /* Assigment of value for IPB in the IP1553_IER register */
#define IP1553_IER_Msk                        _UINT32_(0x01FFFFFF)                                 /* (IP1553_IER) Register Mask  */


