Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/ip1553.h
/* -------- IP1553_ISR : (IP1553 Offset: 0x2C) ( R/ 32) IRQ Status Register -------- */
#define IP1553_ISR_EMT_Pos                    _UINT32_(0)                                          /* (IP1553_ISR) EndMemTransfer Position */
#define IP1553_ISR_EMT_Msk                    (_UINT32_(0x1) << IP1553_ISR_EMT_Pos)                /* (IP1553_ISR) EndMemTransfer Mask */
#define IP1553_ISR_EMT(value)                 (IP1553_ISR_EMT_Msk & (_UINT32_(value) << IP1553_ISR_EMT_Pos)) /* Assigment of value for EMT in the IP1553_ISR register */
#define IP1553_ISR_MTE_Pos                    _UINT32_(1)                                          /* (IP1553_ISR) MemTransferErr Position */
#define IP1553_ISR_MTE_Msk                    (_UINT32_(0x1) << IP1553_ISR_MTE_Pos)                /* (IP1553_ISR) MemTransferErr Mask */
#define IP1553_ISR_MTE(value)                 (IP1553_ISR_MTE_Msk & (_UINT32_(value) << IP1553_ISR_MTE_Pos)) /* Assigment of value for MTE in the IP1553_ISR register */
#define IP1553_ISR_ERX_Pos                    _UINT32_(2)                                          /* (IP1553_ISR) End reception Position */
#define IP1553_ISR_ERX_Msk                    (_UINT32_(0x1) << IP1553_ISR_ERX_Pos)                /* (IP1553_ISR) End reception Mask */
#define IP1553_ISR_ERX(value)                 (IP1553_ISR_ERX_Msk & (_UINT32_(value) << IP1553_ISR_ERX_Pos)) /* Assigment of value for ERX in the IP1553_ISR register */
#define IP1553_ISR_ETX_Pos                    _UINT32_(3)                                          /* (IP1553_ISR) EndTransmission Position */
#define IP1553_ISR_ETX_Msk                    (_UINT32_(0x1) << IP1553_ISR_ETX_Pos)                /* (IP1553_ISR) EndTransmission Mask */
#define IP1553_ISR_ETX(value)                 (IP1553_ISR_ETX_Msk & (_UINT32_(value) << IP1553_ISR_ETX_Pos)) /* Assigment of value for ETX in the IP1553_ISR register */
#define IP1553_ISR_ETRANS_Pos                 _UINT32_(4)                                          /* (IP1553_ISR) EndTransfer Position */
#define IP1553_ISR_ETRANS_Msk                 (_UINT32_(0x3) << IP1553_ISR_ETRANS_Pos)             /* (IP1553_ISR) EndTransfer Mask */
#define IP1553_ISR_ETRANS(value)              (IP1553_ISR_ETRANS_Msk & (_UINT32_(value) << IP1553_ISR_ETRANS_Pos)) /* Assigment of value for ETRANS in the IP1553_ISR register */
#define IP1553_ISR_TE_Pos                     _UINT32_(6)                                          /* (IP1553_ISR) TransErr Position */
#define IP1553_ISR_TE_Msk                     (_UINT32_(0x1) << IP1553_ISR_TE_Pos)                 /* (IP1553_ISR) TransErr Mask */
#define IP1553_ISR_TE(value)                  (IP1553_ISR_TE_Msk & (_UINT32_(value) << IP1553_ISR_TE_Pos)) /* Assigment of value for TE in the IP1553_ISR register */
#define IP1553_ISR_TCE_Pos                    _UINT32_(7)                                          /* (IP1553_ISR) TransCodingErr Position */
#define IP1553_ISR_TCE_Msk                    (_UINT32_(0x1) << IP1553_ISR_TCE_Pos)                /* (IP1553_ISR) TransCodingErr Mask */
#define IP1553_ISR_TCE(value)                 (IP1553_ISR_TCE_Msk & (_UINT32_(value) << IP1553_ISR_TCE_Pos)) /* Assigment of value for TCE in the IP1553_ISR register */
#define IP1553_ISR_TPE_Pos                    _UINT32_(8)                                          /* (IP1553_ISR) TransParityErr Position */
#define IP1553_ISR_TPE_Msk                    (_UINT32_(0x1) << IP1553_ISR_TPE_Pos)                /* (IP1553_ISR) TransParityErr Mask */
#define IP1553_ISR_TPE(value)                 (IP1553_ISR_TPE_Msk & (_UINT32_(value) << IP1553_ISR_TPE_Pos)) /* Assigment of value for TPE in the IP1553_ISR register */
#define IP1553_ISR_TDE_Pos                    _UINT32_(9)                                          /* (IP1553_ISR) TransDataTypeErr Position */
#define IP1553_ISR_TDE_Msk                    (_UINT32_(0x1) << IP1553_ISR_TDE_Pos)                /* (IP1553_ISR) TransDataTypeErr Mask */
#define IP1553_ISR_TDE(value)                 (IP1553_ISR_TDE_Msk & (_UINT32_(value) << IP1553_ISR_TDE_Pos)) /* Assigment of value for TDE in the IP1553_ISR register */
#define IP1553_ISR_TTE_Pos                    _UINT32_(10)                                         /* (IP1553_ISR) TransTimeOutErr Position */
#define IP1553_ISR_TTE_Msk                    (_UINT32_(0x1) << IP1553_ISR_TTE_Pos)                /* (IP1553_ISR) TransTimeOutErr Mask */
#define IP1553_ISR_TTE(value)                 (IP1553_ISR_TTE_Msk & (_UINT32_(value) << IP1553_ISR_TTE_Pos)) /* Assigment of value for TTE in the IP1553_ISR register */
#define IP1553_ISR_TWE_Pos                    _UINT32_(11)                                         /* (IP1553_ISR) TransWordCounterErr Position */
#define IP1553_ISR_TWE_Msk                    (_UINT32_(0x1) << IP1553_ISR_TWE_Pos)                /* (IP1553_ISR) TransWordCounterErr Mask */
#define IP1553_ISR_TWE(value)                 (IP1553_ISR_TWE_Msk & (_UINT32_(value) << IP1553_ISR_TWE_Pos)) /* Assigment of value for TWE in the IP1553_ISR register */
#define IP1553_ISR_BE_Pos                     _UINT32_(12)                                         /* (IP1553_ISR) BufIFErr Position */
#define IP1553_ISR_BE_Msk                     (_UINT32_(0x1) << IP1553_ISR_BE_Pos)                 /* (IP1553_ISR) BufIFErr Mask */
#define IP1553_ISR_BE(value)                  (IP1553_ISR_BE_Msk & (_UINT32_(value) << IP1553_ISR_BE_Pos)) /* Assigment of value for BE in the IP1553_ISR register */
#define IP1553_ISR_ITR_Pos                    _UINT32_(13)                                         /* (IP1553_ISR) IllegalTransferReq Position */
#define IP1553_ISR_ITR_Msk                    (_UINT32_(0x1) << IP1553_ISR_ITR_Pos)                /* (IP1553_ISR) IllegalTransferReq Mask */
#define IP1553_ISR_ITR(value)                 (IP1553_ISR_ITR_Msk & (_UINT32_(value) << IP1553_ISR_ITR_Pos)) /* Assigment of value for ITR in the IP1553_ISR register */
#define IP1553_ISR_TVR_Pos                    _UINT32_(14)                                         /* (IP1553_ISR) TransVecWordReq Position */
#define IP1553_ISR_TVR_Msk                    (_UINT32_(0x1) << IP1553_ISR_TVR_Pos)                /* (IP1553_ISR) TransVecWordReq Mask */
#define IP1553_ISR_TVR(value)                 (IP1553_ISR_TVR_Msk & (_UINT32_(value) << IP1553_ISR_TVR_Pos)) /* Assigment of value for TVR in the IP1553_ISR register */
#define IP1553_ISR_DBR_Pos                    _UINT32_(15)                                         /* (IP1553_ISR) DynamicBusContReq Position */
#define IP1553_ISR_DBR_Msk                    (_UINT32_(0x1) << IP1553_ISR_DBR_Pos)                /* (IP1553_ISR) DynamicBusContReq Mask */
#define IP1553_ISR_DBR(value)                 (IP1553_ISR_DBR_Msk & (_UINT32_(value) << IP1553_ISR_DBR_Pos)) /* Assigment of value for DBR in the IP1553_ISR register */
#define IP1553_ISR_STR_Pos                    _UINT32_(16)                                         /* (IP1553_ISR) InitSelfTestReq Position */
#define IP1553_ISR_STR_Msk                    (_UINT32_(0x1) << IP1553_ISR_STR_Pos)                /* (IP1553_ISR) InitSelfTestReq Mask */
#define IP1553_ISR_STR(value)                 (IP1553_ISR_STR_Msk & (_UINT32_(value) << IP1553_ISR_STR_Pos)) /* Assigment of value for STR in the IP1553_ISR register */
#define IP1553_ISR_TSR_Pos                    _UINT32_(17)                                         /* (IP1553_ISR) TranShutdownReq Position */
#define IP1553_ISR_TSR_Msk                    (_UINT32_(0x1) << IP1553_ISR_TSR_Pos)                /* (IP1553_ISR) TranShutdownReq Mask */
#define IP1553_ISR_TSR(value)                 (IP1553_ISR_TSR_Msk & (_UINT32_(value) << IP1553_ISR_TSR_Pos)) /* Assigment of value for TSR in the IP1553_ISR register */
#define IP1553_ISR_OSR_Pos                    _UINT32_(18)                                         /* (IP1553_ISR) OvTranShutdownReq Position */
#define IP1553_ISR_OSR_Msk                    (_UINT32_(0x1) << IP1553_ISR_OSR_Pos)                /* (IP1553_ISR) OvTranShutdownReq Mask */
#define IP1553_ISR_OSR(value)                 (IP1553_ISR_OSR_Msk & (_UINT32_(value) << IP1553_ISR_OSR_Pos)) /* Assigment of value for OSR in the IP1553_ISR register */
#define IP1553_ISR_SDR_Pos                    _UINT32_(19)                                         /* (IP1553_ISR) SyncWithDataReq Position */
#define IP1553_ISR_SDR_Msk                    (_UINT32_(0x1) << IP1553_ISR_SDR_Pos)                /* (IP1553_ISR) SyncWithDataReq Mask */
#define IP1553_ISR_SDR(value)                 (IP1553_ISR_SDR_Msk & (_UINT32_(value) << IP1553_ISR_SDR_Pos)) /* Assigment of value for SDR in the IP1553_ISR register */
#define IP1553_ISR_SWD_Pos                    _UINT32_(20)                                         /* (IP1553_ISR) SyncWithoutDataReq Position */
#define IP1553_ISR_SWD_Msk                    (_UINT32_(0x1) << IP1553_ISR_SWD_Pos)                /* (IP1553_ISR) SyncWithoutDataReq Mask */
#define IP1553_ISR_SWD(value)                 (IP1553_ISR_SWD_Msk & (_UINT32_(value) << IP1553_ISR_SWD_Pos)) /* Assigment of value for SWD in the IP1553_ISR register */
#define IP1553_ISR_RRT_Pos                    _UINT32_(21)                                         /* (IP1553_ISR) ResetRTReq Position */
#define IP1553_ISR_RRT_Msk                    (_UINT32_(0x1) << IP1553_ISR_RRT_Pos)                /* (IP1553_ISR) ResetRTReq Mask */
#define IP1553_ISR_RRT(value)                 (IP1553_ISR_RRT_Msk & (_UINT32_(value) << IP1553_ISR_RRT_Pos)) /* Assigment of value for RRT in the IP1553_ISR register */
#define IP1553_ISR_ITF_Pos                    _UINT32_(22)                                         /* (IP1553_ISR) InhibitTermFlagReq Position */
#define IP1553_ISR_ITF_Msk                    (_UINT32_(0x1) << IP1553_ISR_ITF_Pos)                /* (IP1553_ISR) InhibitTermFlagReq Mask */
#define IP1553_ISR_ITF(value)                 (IP1553_ISR_ITF_Msk & (_UINT32_(value) << IP1553_ISR_ITF_Pos)) /* Assigment of value for ITF in the IP1553_ISR register */
#define IP1553_ISR_OTF_Pos                    _UINT32_(23)                                         /* (IP1553_ISR) OvInhibitTermFlagReq Position */
#define IP1553_ISR_OTF_Msk                    (_UINT32_(0x1) << IP1553_ISR_OTF_Pos)                /* (IP1553_ISR) OvInhibitTermFlagReq Mask */
#define IP1553_ISR_OTF(value)                 (IP1553_ISR_OTF_Msk & (_UINT32_(value) << IP1553_ISR_OTF_Pos)) /* Assigment of value for OTF in the IP1553_ISR register */
#define IP1553_ISR_IPB_Pos                    _UINT32_(24)                                         /* (IP1553_ISR) IPBusy Position */
#define IP1553_ISR_IPB_Msk                    (_UINT32_(0x1) << IP1553_ISR_IPB_Pos)                /* (IP1553_ISR) IPBusy Mask */
#define IP1553_ISR_IPB(value)                 (IP1553_ISR_IPB_Msk & (_UINT32_(value) << IP1553_ISR_IPB_Pos)) /* Assigment of value for IPB in the IP1553_ISR register */
#define IP1553_ISR_BUS_Pos                    _UINT32_(25)                                         /* (IP1553_ISR) BUS activated on last transfer Position */
#define IP1553_ISR_BUS_Msk                    (_UINT32_(0x1) << IP1553_ISR_BUS_Pos)                /* (IP1553_ISR) BUS activated on last transfer Mask */
#define IP1553_ISR_BUS(value)                 (IP1553_ISR_BUS_Msk & (_UINT32_(value) << IP1553_ISR_BUS_Pos)) /* Assigment of value for BUS in the IP1553_ISR register */
#define IP1553_ISR_Msk                        _UINT32_(0x03FFFFFF)                                 /* (IP1553_ISR) Register Mask  */


