Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/ip1553.h
/* -------- IP1553_CTRL1 : (IP1553 Offset: 0x30) ( R/ 32) Control Register 1 -------- */
#define IP1553_CTRL1_IP1553DATA1_Pos          _UINT32_(0)                                          /* (IP1553_CTRL1) IP1553 data value 1 Position */
#define IP1553_CTRL1_IP1553DATA1_Msk          (_UINT32_(0xFFFF) << IP1553_CTRL1_IP1553DATA1_Pos)   /* (IP1553_CTRL1) IP1553 data value 1 Mask */
#define IP1553_CTRL1_IP1553DATA1(value)       (IP1553_CTRL1_IP1553DATA1_Msk & (_UINT32_(value) << IP1553_CTRL1_IP1553DATA1_Pos)) /* Assigment of value for IP1553DATA1 in the IP1553_CTRL1 register */
#define IP1553_CTRL1_IP1553DATA2_Pos          _UINT32_(16)                                         /* (IP1553_CTRL1) IP1553 data value 2 Position */
#define IP1553_CTRL1_IP1553DATA2_Msk          (_UINT32_(0xFFFF) << IP1553_CTRL1_IP1553DATA2_Pos)   /* (IP1553_CTRL1) IP1553 data value 2 Mask */
#define IP1553_CTRL1_IP1553DATA2(value)       (IP1553_CTRL1_IP1553DATA2_Msk & (_UINT32_(value) << IP1553_CTRL1_IP1553DATA2_Pos)) /* Assigment of value for IP1553DATA2 in the IP1553_CTRL1 register */
#define IP1553_CTRL1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (IP1553_CTRL1) Register Mask  */


/* -------- IP1553_CTRL2 : (IP1553 Offset: 0x34) ( R/ 32) Control Register 2 -------- */
#define IP1553_CTRL2_FROMCOMMANDREG_Pos       _UINT32_(0)                                          /* (IP1553_CTRL2) from command register Position */
#define IP1553_CTRL2_FROMCOMMANDREG_Msk       (_UINT32_(0xF) << IP1553_CTRL2_FROMCOMMANDREG_Pos)   /* (IP1553_CTRL2) from command register Mask */
#define IP1553_CTRL2_FROMCOMMANDREG(value)    (IP1553_CTRL2_FROMCOMMANDREG_Msk & (_UINT32_(value) << IP1553_CTRL2_FROMCOMMANDREG_Pos)) /* Assigment of value for FROMCOMMANDREG in the IP1553_CTRL2 register */
#define IP1553_CTRL2_FROMVECTORWORD_Pos       _UINT32_(4)                                          /* (IP1553_CTRL2) from vector register Position */
#define IP1553_CTRL2_FROMVECTORWORD_Msk       (_UINT32_(0xFFFF) << IP1553_CTRL2_FROMVECTORWORD_Pos) /* (IP1553_CTRL2) from vector register Mask */
#define IP1553_CTRL2_FROMVECTORWORD(value)    (IP1553_CTRL2_FROMVECTORWORD_Msk & (_UINT32_(value) << IP1553_CTRL2_FROMVECTORWORD_Pos)) /* Assigment of value for FROMVECTORWORD in the IP1553_CTRL2 register */
#define IP1553_CTRL2_Msk                      _UINT32_(0x000FFFFF)                                 /* (IP1553_CTRL2) Register Mask  */


/* -------- IP1553_CTRL3 : (IP1553 Offset: 0x38) ( R/ 32) Control Register 3 -------- */
#define IP1553_CTRL3_FROMSTATUSWORD_Pos       _UINT32_(0)                                          /* (IP1553_CTRL3) content of status word register Position */
#define IP1553_CTRL3_FROMSTATUSWORD_Msk       (_UINT32_(0xFFFF) << IP1553_CTRL3_FROMSTATUSWORD_Pos) /* (IP1553_CTRL3) content of status word register Mask */
#define IP1553_CTRL3_FROMSTATUSWORD(value)    (IP1553_CTRL3_FROMSTATUSWORD_Msk & (_UINT32_(value) << IP1553_CTRL3_FROMSTATUSWORD_Pos)) /* Assigment of value for FROMSTATUSWORD in the IP1553_CTRL3 register */
#define IP1553_CTRL3_FROMBITWORD_Pos          _UINT32_(16)                                         /* (IP1553_CTRL3) content of bit word register Position */
#define IP1553_CTRL3_FROMBITWORD_Msk          (_UINT32_(0xFFFF) << IP1553_CTRL3_FROMBITWORD_Pos)   /* (IP1553_CTRL3) content of bit word register Mask */
#define IP1553_CTRL3_FROMBITWORD(value)       (IP1553_CTRL3_FROMBITWORD_Msk & (_UINT32_(value) << IP1553_CTRL3_FROMBITWORD_Pos)) /* Assigment of value for FROMBITWORD in the IP1553_CTRL3 register */
#define IP1553_CTRL3_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (IP1553_CTRL3) Register Mask  */


/* -------- IP1553_ARW : (IP1553 Offset: 0x3C) (R/W 32) Address Register Write -------- */
#define IP1553_ARW_REG_ADDR_APB_W_Pos         _UINT32_(0)                                          /* (IP1553_ARW) TX base address Position */
#define IP1553_ARW_REG_ADDR_APB_W_Msk         (_UINT32_(0xFFFFFFFF) << IP1553_ARW_REG_ADDR_APB_W_Pos) /* (IP1553_ARW) TX base address Mask */
#define IP1553_ARW_REG_ADDR_APB_W(value)      (IP1553_ARW_REG_ADDR_APB_W_Msk & (_UINT32_(value) << IP1553_ARW_REG_ADDR_APB_W_Pos)) /* Assigment of value for REG_ADDR_APB_W in the IP1553_ARW register */
#define IP1553_ARW_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (IP1553_ARW) Register Mask  */


/* -------- IP1553_ARR : (IP1553 Offset: 0x40) (R/W 32) Address Register Read -------- */
#define IP1553_ARR_REG_ADDR_APB_R_Pos         _UINT32_(0)                                          /* (IP1553_ARR) RX base address Position */
#define IP1553_ARR_REG_ADDR_APB_R_Msk         (_UINT32_(0xFFFFFFFF) << IP1553_ARR_REG_ADDR_APB_R_Pos) /* (IP1553_ARR) RX base address Mask */
#define IP1553_ARR_REG_ADDR_APB_R(value)      (IP1553_ARR_REG_ADDR_APB_R_Msk & (_UINT32_(value) << IP1553_ARR_REG_ADDR_APB_R_Pos)) /* Assigment of value for REG_ADDR_APB_R in the IP1553_ARR register */
#define IP1553_ARR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (IP1553_ARR) Register Mask  */


/* -------- IP1553_RXBSR : (IP1553 Offset: 0x44) (R/W 32) Rx Buffer Status Register -------- */
#define IP1553_RXBSR_RE0_Pos                  _UINT32_(0)                                          /* (IP1553_RXBSR) Receive Buffer, 0 with x=[0-31] Position */
#define IP1553_RXBSR_RE0_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE0_Pos)              /* (IP1553_RXBSR) Receive Buffer, 0 with x=[0-31] Mask */
#define IP1553_RXBSR_RE0(value)               (IP1553_RXBSR_RE0_Msk & (_UINT32_(value) << IP1553_RXBSR_RE0_Pos)) /* Assigment of value for RE0 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE1_Pos                  _UINT32_(1)                                          /* (IP1553_RXBSR) Receive Buffer, 1 with x=[0-31] Position */
#define IP1553_RXBSR_RE1_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE1_Pos)              /* (IP1553_RXBSR) Receive Buffer, 1 with x=[0-31] Mask */
#define IP1553_RXBSR_RE1(value)               (IP1553_RXBSR_RE1_Msk & (_UINT32_(value) << IP1553_RXBSR_RE1_Pos)) /* Assigment of value for RE1 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE2_Pos                  _UINT32_(2)                                          /* (IP1553_RXBSR) Receive Buffer, 2 with x=[0-31] Position */
#define IP1553_RXBSR_RE2_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE2_Pos)              /* (IP1553_RXBSR) Receive Buffer, 2 with x=[0-31] Mask */
#define IP1553_RXBSR_RE2(value)               (IP1553_RXBSR_RE2_Msk & (_UINT32_(value) << IP1553_RXBSR_RE2_Pos)) /* Assigment of value for RE2 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE3_Pos                  _UINT32_(3)                                          /* (IP1553_RXBSR) Receive Buffer, 3 with x=[0-31] Position */
#define IP1553_RXBSR_RE3_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE3_Pos)              /* (IP1553_RXBSR) Receive Buffer, 3 with x=[0-31] Mask */
#define IP1553_RXBSR_RE3(value)               (IP1553_RXBSR_RE3_Msk & (_UINT32_(value) << IP1553_RXBSR_RE3_Pos)) /* Assigment of value for RE3 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE4_Pos                  _UINT32_(4)                                          /* (IP1553_RXBSR) Receive Buffer, 4 with x=[0-31] Position */
#define IP1553_RXBSR_RE4_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE4_Pos)              /* (IP1553_RXBSR) Receive Buffer, 4 with x=[0-31] Mask */
#define IP1553_RXBSR_RE4(value)               (IP1553_RXBSR_RE4_Msk & (_UINT32_(value) << IP1553_RXBSR_RE4_Pos)) /* Assigment of value for RE4 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE5_Pos                  _UINT32_(5)                                          /* (IP1553_RXBSR) Receive Buffer, 5 with x=[0-31] Position */
#define IP1553_RXBSR_RE5_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE5_Pos)              /* (IP1553_RXBSR) Receive Buffer, 5 with x=[0-31] Mask */
#define IP1553_RXBSR_RE5(value)               (IP1553_RXBSR_RE5_Msk & (_UINT32_(value) << IP1553_RXBSR_RE5_Pos)) /* Assigment of value for RE5 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE6_Pos                  _UINT32_(6)                                          /* (IP1553_RXBSR) Receive Buffer, 6 with x=[0-31] Position */
#define IP1553_RXBSR_RE6_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE6_Pos)              /* (IP1553_RXBSR) Receive Buffer, 6 with x=[0-31] Mask */
#define IP1553_RXBSR_RE6(value)               (IP1553_RXBSR_RE6_Msk & (_UINT32_(value) << IP1553_RXBSR_RE6_Pos)) /* Assigment of value for RE6 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE7_Pos                  _UINT32_(7)                                          /* (IP1553_RXBSR) Receive Buffer, 7 with x=[0-31] Position */
#define IP1553_RXBSR_RE7_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE7_Pos)              /* (IP1553_RXBSR) Receive Buffer, 7 with x=[0-31] Mask */
#define IP1553_RXBSR_RE7(value)               (IP1553_RXBSR_RE7_Msk & (_UINT32_(value) << IP1553_RXBSR_RE7_Pos)) /* Assigment of value for RE7 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE8_Pos                  _UINT32_(8)                                          /* (IP1553_RXBSR) Receive Buffer, 8 with x=[0-31] Position */
#define IP1553_RXBSR_RE8_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE8_Pos)              /* (IP1553_RXBSR) Receive Buffer, 8 with x=[0-31] Mask */
#define IP1553_RXBSR_RE8(value)               (IP1553_RXBSR_RE8_Msk & (_UINT32_(value) << IP1553_RXBSR_RE8_Pos)) /* Assigment of value for RE8 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE9_Pos                  _UINT32_(9)                                          /* (IP1553_RXBSR) Receive Buffer, 9 with x=[0-31] Position */
#define IP1553_RXBSR_RE9_Msk                  (_UINT32_(0x1) << IP1553_RXBSR_RE9_Pos)              /* (IP1553_RXBSR) Receive Buffer, 9 with x=[0-31] Mask */
#define IP1553_RXBSR_RE9(value)               (IP1553_RXBSR_RE9_Msk & (_UINT32_(value) << IP1553_RXBSR_RE9_Pos)) /* Assigment of value for RE9 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE10_Pos                 _UINT32_(10)                                         /* (IP1553_RXBSR) Receive Buffer, 10 with x=[0-31] Position */
#define IP1553_RXBSR_RE10_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE10_Pos)             /* (IP1553_RXBSR) Receive Buffer, 10 with x=[0-31] Mask */
#define IP1553_RXBSR_RE10(value)              (IP1553_RXBSR_RE10_Msk & (_UINT32_(value) << IP1553_RXBSR_RE10_Pos)) /* Assigment of value for RE10 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE11_Pos                 _UINT32_(11)                                         /* (IP1553_RXBSR) Receive Buffer, 11 with x=[0-31] Position */
#define IP1553_RXBSR_RE11_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE11_Pos)             /* (IP1553_RXBSR) Receive Buffer, 11 with x=[0-31] Mask */
#define IP1553_RXBSR_RE11(value)              (IP1553_RXBSR_RE11_Msk & (_UINT32_(value) << IP1553_RXBSR_RE11_Pos)) /* Assigment of value for RE11 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE12_Pos                 _UINT32_(12)                                         /* (IP1553_RXBSR) Receive Buffer, 12 with x=[0-31] Position */
#define IP1553_RXBSR_RE12_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE12_Pos)             /* (IP1553_RXBSR) Receive Buffer, 12 with x=[0-31] Mask */
#define IP1553_RXBSR_RE12(value)              (IP1553_RXBSR_RE12_Msk & (_UINT32_(value) << IP1553_RXBSR_RE12_Pos)) /* Assigment of value for RE12 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE13_Pos                 _UINT32_(13)                                         /* (IP1553_RXBSR) Receive Buffer, 13 with x=[0-31] Position */
#define IP1553_RXBSR_RE13_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE13_Pos)             /* (IP1553_RXBSR) Receive Buffer, 13 with x=[0-31] Mask */
#define IP1553_RXBSR_RE13(value)              (IP1553_RXBSR_RE13_Msk & (_UINT32_(value) << IP1553_RXBSR_RE13_Pos)) /* Assigment of value for RE13 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE14_Pos                 _UINT32_(14)                                         /* (IP1553_RXBSR) Receive Buffer, 14 with x=[0-31] Position */
#define IP1553_RXBSR_RE14_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE14_Pos)             /* (IP1553_RXBSR) Receive Buffer, 14 with x=[0-31] Mask */
#define IP1553_RXBSR_RE14(value)              (IP1553_RXBSR_RE14_Msk & (_UINT32_(value) << IP1553_RXBSR_RE14_Pos)) /* Assigment of value for RE14 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE15_Pos                 _UINT32_(15)                                         /* (IP1553_RXBSR) Receive Buffer, 15 with x=[0-31] Position */
#define IP1553_RXBSR_RE15_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE15_Pos)             /* (IP1553_RXBSR) Receive Buffer, 15 with x=[0-31] Mask */
#define IP1553_RXBSR_RE15(value)              (IP1553_RXBSR_RE15_Msk & (_UINT32_(value) << IP1553_RXBSR_RE15_Pos)) /* Assigment of value for RE15 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE16_Pos                 _UINT32_(16)                                         /* (IP1553_RXBSR) Receive Buffer, 16 with x=[0-31] Position */
#define IP1553_RXBSR_RE16_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE16_Pos)             /* (IP1553_RXBSR) Receive Buffer, 16 with x=[0-31] Mask */
#define IP1553_RXBSR_RE16(value)              (IP1553_RXBSR_RE16_Msk & (_UINT32_(value) << IP1553_RXBSR_RE16_Pos)) /* Assigment of value for RE16 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE17_Pos                 _UINT32_(17)                                         /* (IP1553_RXBSR) Receive Buffer, 17 with x=[0-31] Position */
#define IP1553_RXBSR_RE17_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE17_Pos)             /* (IP1553_RXBSR) Receive Buffer, 17 with x=[0-31] Mask */
#define IP1553_RXBSR_RE17(value)              (IP1553_RXBSR_RE17_Msk & (_UINT32_(value) << IP1553_RXBSR_RE17_Pos)) /* Assigment of value for RE17 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE18_Pos                 _UINT32_(18)                                         /* (IP1553_RXBSR) Receive Buffer, 18 with x=[0-31] Position */
#define IP1553_RXBSR_RE18_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE18_Pos)             /* (IP1553_RXBSR) Receive Buffer, 18 with x=[0-31] Mask */
#define IP1553_RXBSR_RE18(value)              (IP1553_RXBSR_RE18_Msk & (_UINT32_(value) << IP1553_RXBSR_RE18_Pos)) /* Assigment of value for RE18 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE19_Pos                 _UINT32_(19)                                         /* (IP1553_RXBSR) Receive Buffer, 19 with x=[0-31] Position */
#define IP1553_RXBSR_RE19_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE19_Pos)             /* (IP1553_RXBSR) Receive Buffer, 19 with x=[0-31] Mask */
#define IP1553_RXBSR_RE19(value)              (IP1553_RXBSR_RE19_Msk & (_UINT32_(value) << IP1553_RXBSR_RE19_Pos)) /* Assigment of value for RE19 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE20_Pos                 _UINT32_(20)                                         /* (IP1553_RXBSR) Receive Buffer, 20 with x=[0-31] Position */
#define IP1553_RXBSR_RE20_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE20_Pos)             /* (IP1553_RXBSR) Receive Buffer, 20 with x=[0-31] Mask */
#define IP1553_RXBSR_RE20(value)              (IP1553_RXBSR_RE20_Msk & (_UINT32_(value) << IP1553_RXBSR_RE20_Pos)) /* Assigment of value for RE20 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE21_Pos                 _UINT32_(21)                                         /* (IP1553_RXBSR) Receive Buffer, 21 with x=[0-31] Position */
#define IP1553_RXBSR_RE21_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE21_Pos)             /* (IP1553_RXBSR) Receive Buffer, 21 with x=[0-31] Mask */
#define IP1553_RXBSR_RE21(value)              (IP1553_RXBSR_RE21_Msk & (_UINT32_(value) << IP1553_RXBSR_RE21_Pos)) /* Assigment of value for RE21 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE22_Pos                 _UINT32_(22)                                         /* (IP1553_RXBSR) Receive Buffer, 22 with x=[0-31] Position */
#define IP1553_RXBSR_RE22_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE22_Pos)             /* (IP1553_RXBSR) Receive Buffer, 22 with x=[0-31] Mask */
#define IP1553_RXBSR_RE22(value)              (IP1553_RXBSR_RE22_Msk & (_UINT32_(value) << IP1553_RXBSR_RE22_Pos)) /* Assigment of value for RE22 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE23_Pos                 _UINT32_(23)                                         /* (IP1553_RXBSR) Receive Buffer, 23 with x=[0-31] Position */
#define IP1553_RXBSR_RE23_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE23_Pos)             /* (IP1553_RXBSR) Receive Buffer, 23 with x=[0-31] Mask */
#define IP1553_RXBSR_RE23(value)              (IP1553_RXBSR_RE23_Msk & (_UINT32_(value) << IP1553_RXBSR_RE23_Pos)) /* Assigment of value for RE23 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE24_Pos                 _UINT32_(24)                                         /* (IP1553_RXBSR) Receive Buffer, 24 with x=[0-31] Position */
#define IP1553_RXBSR_RE24_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE24_Pos)             /* (IP1553_RXBSR) Receive Buffer, 24 with x=[0-31] Mask */
#define IP1553_RXBSR_RE24(value)              (IP1553_RXBSR_RE24_Msk & (_UINT32_(value) << IP1553_RXBSR_RE24_Pos)) /* Assigment of value for RE24 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE25_Pos                 _UINT32_(25)                                         /* (IP1553_RXBSR) Receive Buffer, 25 with x=[0-31] Position */
#define IP1553_RXBSR_RE25_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE25_Pos)             /* (IP1553_RXBSR) Receive Buffer, 25 with x=[0-31] Mask */
#define IP1553_RXBSR_RE25(value)              (IP1553_RXBSR_RE25_Msk & (_UINT32_(value) << IP1553_RXBSR_RE25_Pos)) /* Assigment of value for RE25 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE26_Pos                 _UINT32_(26)                                         /* (IP1553_RXBSR) Receive Buffer, 26 with x=[0-31] Position */
#define IP1553_RXBSR_RE26_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE26_Pos)             /* (IP1553_RXBSR) Receive Buffer, 26 with x=[0-31] Mask */
#define IP1553_RXBSR_RE26(value)              (IP1553_RXBSR_RE26_Msk & (_UINT32_(value) << IP1553_RXBSR_RE26_Pos)) /* Assigment of value for RE26 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE27_Pos                 _UINT32_(27)                                         /* (IP1553_RXBSR) Receive Buffer, 27 with x=[0-31] Position */
#define IP1553_RXBSR_RE27_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE27_Pos)             /* (IP1553_RXBSR) Receive Buffer, 27 with x=[0-31] Mask */
#define IP1553_RXBSR_RE27(value)              (IP1553_RXBSR_RE27_Msk & (_UINT32_(value) << IP1553_RXBSR_RE27_Pos)) /* Assigment of value for RE27 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE28_Pos                 _UINT32_(28)                                         /* (IP1553_RXBSR) Receive Buffer, 28 with x=[0-31] Position */
#define IP1553_RXBSR_RE28_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE28_Pos)             /* (IP1553_RXBSR) Receive Buffer, 28 with x=[0-31] Mask */
#define IP1553_RXBSR_RE28(value)              (IP1553_RXBSR_RE28_Msk & (_UINT32_(value) << IP1553_RXBSR_RE28_Pos)) /* Assigment of value for RE28 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE29_Pos                 _UINT32_(29)                                         /* (IP1553_RXBSR) Receive Buffer, 29 with x=[0-31] Position */
#define IP1553_RXBSR_RE29_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE29_Pos)             /* (IP1553_RXBSR) Receive Buffer, 29 with x=[0-31] Mask */
#define IP1553_RXBSR_RE29(value)              (IP1553_RXBSR_RE29_Msk & (_UINT32_(value) << IP1553_RXBSR_RE29_Pos)) /* Assigment of value for RE29 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE30_Pos                 _UINT32_(30)                                         /* (IP1553_RXBSR) Receive Buffer, 30 with x=[0-31] Position */
#define IP1553_RXBSR_RE30_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE30_Pos)             /* (IP1553_RXBSR) Receive Buffer, 30 with x=[0-31] Mask */
#define IP1553_RXBSR_RE30(value)              (IP1553_RXBSR_RE30_Msk & (_UINT32_(value) << IP1553_RXBSR_RE30_Pos)) /* Assigment of value for RE30 in the IP1553_RXBSR register */
#define IP1553_RXBSR_RE31_Pos                 _UINT32_(31)                                         /* (IP1553_RXBSR) Receive Buffer, 31 with x=[0-31] Position */
#define IP1553_RXBSR_RE31_Msk                 (_UINT32_(0x1) << IP1553_RXBSR_RE31_Pos)             /* (IP1553_RXBSR) Receive Buffer, 31 with x=[0-31] Mask */
#define IP1553_RXBSR_RE31(value)              (IP1553_RXBSR_RE31_Msk & (_UINT32_(value) << IP1553_RXBSR_RE31_Pos)) /* Assigment of value for RE31 in the IP1553_RXBSR register */
#define IP1553_RXBSR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (IP1553_RXBSR) Register Mask  */

#define IP1553_RXBSR_RE_Pos                   _UINT32_(0)                                          /* (IP1553_RXBSR Position) Receive Buffer, 3x with x=[x-3x] */
#define IP1553_RXBSR_RE_Msk                   (_UINT32_(0xFFFFFFFF) << IP1553_RXBSR_RE_Pos)        /* (IP1553_RXBSR Mask) RE */
#define IP1553_RXBSR_RE(value)                (IP1553_RXBSR_RE_Msk & (_UINT32_(value) << IP1553_RXBSR_RE_Pos)) 

