Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/ip1553.h
/* -------- IP1553_RXBAER : (IP1553 Offset: 0x48) (R/W 32) Rx Buffer Access Error Register -------- */
#define IP1553_RXBAER_RER0_Pos                _UINT32_(0)                                          /* (IP1553_RXBAER) Receive error 0, x with x=[0-31] Position */
#define IP1553_RXBAER_RER0_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER0_Pos)            /* (IP1553_RXBAER) Receive error 0, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER0(value)             (IP1553_RXBAER_RER0_Msk & (_UINT32_(value) << IP1553_RXBAER_RER0_Pos)) /* Assigment of value for RER0 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER1_Pos                _UINT32_(1)                                          /* (IP1553_RXBAER) Receive error 1, x with x=[0-31] Position */
#define IP1553_RXBAER_RER1_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER1_Pos)            /* (IP1553_RXBAER) Receive error 1, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER1(value)             (IP1553_RXBAER_RER1_Msk & (_UINT32_(value) << IP1553_RXBAER_RER1_Pos)) /* Assigment of value for RER1 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER2_Pos                _UINT32_(2)                                          /* (IP1553_RXBAER) Receive error 2, x with x=[0-31] Position */
#define IP1553_RXBAER_RER2_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER2_Pos)            /* (IP1553_RXBAER) Receive error 2, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER2(value)             (IP1553_RXBAER_RER2_Msk & (_UINT32_(value) << IP1553_RXBAER_RER2_Pos)) /* Assigment of value for RER2 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER3_Pos                _UINT32_(3)                                          /* (IP1553_RXBAER) Receive error 3, x with x=[0-31] Position */
#define IP1553_RXBAER_RER3_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER3_Pos)            /* (IP1553_RXBAER) Receive error 3, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER3(value)             (IP1553_RXBAER_RER3_Msk & (_UINT32_(value) << IP1553_RXBAER_RER3_Pos)) /* Assigment of value for RER3 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER4_Pos                _UINT32_(4)                                          /* (IP1553_RXBAER) Receive error 4, x with x=[0-31] Position */
#define IP1553_RXBAER_RER4_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER4_Pos)            /* (IP1553_RXBAER) Receive error 4, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER4(value)             (IP1553_RXBAER_RER4_Msk & (_UINT32_(value) << IP1553_RXBAER_RER4_Pos)) /* Assigment of value for RER4 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER5_Pos                _UINT32_(5)                                          /* (IP1553_RXBAER) Receive error 5, x with x=[0-31] Position */
#define IP1553_RXBAER_RER5_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER5_Pos)            /* (IP1553_RXBAER) Receive error 5, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER5(value)             (IP1553_RXBAER_RER5_Msk & (_UINT32_(value) << IP1553_RXBAER_RER5_Pos)) /* Assigment of value for RER5 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER6_Pos                _UINT32_(6)                                          /* (IP1553_RXBAER) Receive error 6, x with x=[0-31] Position */
#define IP1553_RXBAER_RER6_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER6_Pos)            /* (IP1553_RXBAER) Receive error 6, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER6(value)             (IP1553_RXBAER_RER6_Msk & (_UINT32_(value) << IP1553_RXBAER_RER6_Pos)) /* Assigment of value for RER6 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER7_Pos                _UINT32_(7)                                          /* (IP1553_RXBAER) Receive error 7, x with x=[0-31] Position */
#define IP1553_RXBAER_RER7_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER7_Pos)            /* (IP1553_RXBAER) Receive error 7, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER7(value)             (IP1553_RXBAER_RER7_Msk & (_UINT32_(value) << IP1553_RXBAER_RER7_Pos)) /* Assigment of value for RER7 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER8_Pos                _UINT32_(8)                                          /* (IP1553_RXBAER) Receive error 8, x with x=[0-31] Position */
#define IP1553_RXBAER_RER8_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER8_Pos)            /* (IP1553_RXBAER) Receive error 8, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER8(value)             (IP1553_RXBAER_RER8_Msk & (_UINT32_(value) << IP1553_RXBAER_RER8_Pos)) /* Assigment of value for RER8 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER9_Pos                _UINT32_(9)                                          /* (IP1553_RXBAER) Receive error 9, x with x=[0-31] Position */
#define IP1553_RXBAER_RER9_Msk                (_UINT32_(0x1) << IP1553_RXBAER_RER9_Pos)            /* (IP1553_RXBAER) Receive error 9, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER9(value)             (IP1553_RXBAER_RER9_Msk & (_UINT32_(value) << IP1553_RXBAER_RER9_Pos)) /* Assigment of value for RER9 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER10_Pos               _UINT32_(10)                                         /* (IP1553_RXBAER) Receive error 10, x with x=[0-31] Position */
#define IP1553_RXBAER_RER10_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER10_Pos)           /* (IP1553_RXBAER) Receive error 10, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER10(value)            (IP1553_RXBAER_RER10_Msk & (_UINT32_(value) << IP1553_RXBAER_RER10_Pos)) /* Assigment of value for RER10 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER11_Pos               _UINT32_(11)                                         /* (IP1553_RXBAER) Receive error 11, x with x=[0-31] Position */
#define IP1553_RXBAER_RER11_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER11_Pos)           /* (IP1553_RXBAER) Receive error 11, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER11(value)            (IP1553_RXBAER_RER11_Msk & (_UINT32_(value) << IP1553_RXBAER_RER11_Pos)) /* Assigment of value for RER11 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER12_Pos               _UINT32_(12)                                         /* (IP1553_RXBAER) Receive error 12, x with x=[0-31] Position */
#define IP1553_RXBAER_RER12_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER12_Pos)           /* (IP1553_RXBAER) Receive error 12, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER12(value)            (IP1553_RXBAER_RER12_Msk & (_UINT32_(value) << IP1553_RXBAER_RER12_Pos)) /* Assigment of value for RER12 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER13_Pos               _UINT32_(13)                                         /* (IP1553_RXBAER) Receive error 13, x with x=[0-31] Position */
#define IP1553_RXBAER_RER13_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER13_Pos)           /* (IP1553_RXBAER) Receive error 13, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER13(value)            (IP1553_RXBAER_RER13_Msk & (_UINT32_(value) << IP1553_RXBAER_RER13_Pos)) /* Assigment of value for RER13 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER14_Pos               _UINT32_(14)                                         /* (IP1553_RXBAER) Receive error 14, x with x=[0-31] Position */
#define IP1553_RXBAER_RER14_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER14_Pos)           /* (IP1553_RXBAER) Receive error 14, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER14(value)            (IP1553_RXBAER_RER14_Msk & (_UINT32_(value) << IP1553_RXBAER_RER14_Pos)) /* Assigment of value for RER14 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER15_Pos               _UINT32_(15)                                         /* (IP1553_RXBAER) Receive error 15, x with x=[0-31] Position */
#define IP1553_RXBAER_RER15_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER15_Pos)           /* (IP1553_RXBAER) Receive error 15, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER15(value)            (IP1553_RXBAER_RER15_Msk & (_UINT32_(value) << IP1553_RXBAER_RER15_Pos)) /* Assigment of value for RER15 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER16_Pos               _UINT32_(16)                                         /* (IP1553_RXBAER) Receive error 16, x with x=[0-31] Position */
#define IP1553_RXBAER_RER16_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER16_Pos)           /* (IP1553_RXBAER) Receive error 16, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER16(value)            (IP1553_RXBAER_RER16_Msk & (_UINT32_(value) << IP1553_RXBAER_RER16_Pos)) /* Assigment of value for RER16 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER17_Pos               _UINT32_(17)                                         /* (IP1553_RXBAER) Receive error 17, x with x=[0-31] Position */
#define IP1553_RXBAER_RER17_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER17_Pos)           /* (IP1553_RXBAER) Receive error 17, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER17(value)            (IP1553_RXBAER_RER17_Msk & (_UINT32_(value) << IP1553_RXBAER_RER17_Pos)) /* Assigment of value for RER17 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER18_Pos               _UINT32_(18)                                         /* (IP1553_RXBAER) Receive error 18, x with x=[0-31] Position */
#define IP1553_RXBAER_RER18_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER18_Pos)           /* (IP1553_RXBAER) Receive error 18, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER18(value)            (IP1553_RXBAER_RER18_Msk & (_UINT32_(value) << IP1553_RXBAER_RER18_Pos)) /* Assigment of value for RER18 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER19_Pos               _UINT32_(19)                                         /* (IP1553_RXBAER) Receive error 19, x with x=[0-31] Position */
#define IP1553_RXBAER_RER19_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER19_Pos)           /* (IP1553_RXBAER) Receive error 19, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER19(value)            (IP1553_RXBAER_RER19_Msk & (_UINT32_(value) << IP1553_RXBAER_RER19_Pos)) /* Assigment of value for RER19 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER20_Pos               _UINT32_(20)                                         /* (IP1553_RXBAER) Receive error 20, x with x=[0-31] Position */
#define IP1553_RXBAER_RER20_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER20_Pos)           /* (IP1553_RXBAER) Receive error 20, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER20(value)            (IP1553_RXBAER_RER20_Msk & (_UINT32_(value) << IP1553_RXBAER_RER20_Pos)) /* Assigment of value for RER20 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER21_Pos               _UINT32_(21)                                         /* (IP1553_RXBAER) Receive error 21, x with x=[0-31] Position */
#define IP1553_RXBAER_RER21_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER21_Pos)           /* (IP1553_RXBAER) Receive error 21, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER21(value)            (IP1553_RXBAER_RER21_Msk & (_UINT32_(value) << IP1553_RXBAER_RER21_Pos)) /* Assigment of value for RER21 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER22_Pos               _UINT32_(22)                                         /* (IP1553_RXBAER) Receive error 22, x with x=[0-31] Position */
#define IP1553_RXBAER_RER22_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER22_Pos)           /* (IP1553_RXBAER) Receive error 22, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER22(value)            (IP1553_RXBAER_RER22_Msk & (_UINT32_(value) << IP1553_RXBAER_RER22_Pos)) /* Assigment of value for RER22 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER23_Pos               _UINT32_(23)                                         /* (IP1553_RXBAER) Receive error 23, x with x=[0-31] Position */
#define IP1553_RXBAER_RER23_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER23_Pos)           /* (IP1553_RXBAER) Receive error 23, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER23(value)            (IP1553_RXBAER_RER23_Msk & (_UINT32_(value) << IP1553_RXBAER_RER23_Pos)) /* Assigment of value for RER23 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER24_Pos               _UINT32_(24)                                         /* (IP1553_RXBAER) Receive error 24, x with x=[0-31] Position */
#define IP1553_RXBAER_RER24_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER24_Pos)           /* (IP1553_RXBAER) Receive error 24, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER24(value)            (IP1553_RXBAER_RER24_Msk & (_UINT32_(value) << IP1553_RXBAER_RER24_Pos)) /* Assigment of value for RER24 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER25_Pos               _UINT32_(25)                                         /* (IP1553_RXBAER) Receive error 25, x with x=[0-31] Position */
#define IP1553_RXBAER_RER25_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER25_Pos)           /* (IP1553_RXBAER) Receive error 25, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER25(value)            (IP1553_RXBAER_RER25_Msk & (_UINT32_(value) << IP1553_RXBAER_RER25_Pos)) /* Assigment of value for RER25 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER26_Pos               _UINT32_(26)                                         /* (IP1553_RXBAER) Receive error 26, x with x=[0-31] Position */
#define IP1553_RXBAER_RER26_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER26_Pos)           /* (IP1553_RXBAER) Receive error 26, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER26(value)            (IP1553_RXBAER_RER26_Msk & (_UINT32_(value) << IP1553_RXBAER_RER26_Pos)) /* Assigment of value for RER26 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER27_Pos               _UINT32_(27)                                         /* (IP1553_RXBAER) Receive error 27, x with x=[0-31] Position */
#define IP1553_RXBAER_RER27_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER27_Pos)           /* (IP1553_RXBAER) Receive error 27, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER27(value)            (IP1553_RXBAER_RER27_Msk & (_UINT32_(value) << IP1553_RXBAER_RER27_Pos)) /* Assigment of value for RER27 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER28_Pos               _UINT32_(28)                                         /* (IP1553_RXBAER) Receive error 28, x with x=[0-31] Position */
#define IP1553_RXBAER_RER28_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER28_Pos)           /* (IP1553_RXBAER) Receive error 28, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER28(value)            (IP1553_RXBAER_RER28_Msk & (_UINT32_(value) << IP1553_RXBAER_RER28_Pos)) /* Assigment of value for RER28 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER29_Pos               _UINT32_(29)                                         /* (IP1553_RXBAER) Receive error 29, x with x=[0-31] Position */
#define IP1553_RXBAER_RER29_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER29_Pos)           /* (IP1553_RXBAER) Receive error 29, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER29(value)            (IP1553_RXBAER_RER29_Msk & (_UINT32_(value) << IP1553_RXBAER_RER29_Pos)) /* Assigment of value for RER29 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER30_Pos               _UINT32_(30)                                         /* (IP1553_RXBAER) Receive error 30, x with x=[0-31] Position */
#define IP1553_RXBAER_RER30_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER30_Pos)           /* (IP1553_RXBAER) Receive error 30, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER30(value)            (IP1553_RXBAER_RER30_Msk & (_UINT32_(value) << IP1553_RXBAER_RER30_Pos)) /* Assigment of value for RER30 in the IP1553_RXBAER register */
#define IP1553_RXBAER_RER31_Pos               _UINT32_(31)                                         /* (IP1553_RXBAER) Receive error 31, x with x=[0-31] Position */
#define IP1553_RXBAER_RER31_Msk               (_UINT32_(0x1) << IP1553_RXBAER_RER31_Pos)           /* (IP1553_RXBAER) Receive error 31, x with x=[0-31] Mask */
#define IP1553_RXBAER_RER31(value)            (IP1553_RXBAER_RER31_Msk & (_UINT32_(value) << IP1553_RXBAER_RER31_Pos)) /* Assigment of value for RER31 in the IP1553_RXBAER register */
#define IP1553_RXBAER_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (IP1553_RXBAER) Register Mask  */

#define IP1553_RXBAER_RER_Pos                 _UINT32_(0)                                          /* (IP1553_RXBAER Position) Receive error 3x, x with x=[x-3x] */
#define IP1553_RXBAER_RER_Msk                 (_UINT32_(0xFFFFFFFF) << IP1553_RXBAER_RER_Pos)      /* (IP1553_RXBAER Mask) RER */
#define IP1553_RXBAER_RER(value)              (IP1553_RXBAER_RER_Msk & (_UINT32_(value) << IP1553_RXBAER_RER_Pos)) 

