Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/ip1553.h
/* -------- IP1553_TXBSR : (IP1553 Offset: 0x4C) (R/W 32) Tx Buffer Status Register -------- */
#define IP1553_TXBSR_TF0_Pos                  _UINT32_(0)                                          /* (IP1553_TXBSR) Transmit buffer 0, x with x=[0-31] Position */
#define IP1553_TXBSR_TF0_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF0_Pos)              /* (IP1553_TXBSR) Transmit buffer 0, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF0(value)               (IP1553_TXBSR_TF0_Msk & (_UINT32_(value) << IP1553_TXBSR_TF0_Pos)) /* Assigment of value for TF0 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF1_Pos                  _UINT32_(1)                                          /* (IP1553_TXBSR) Transmit buffer 1, x with x=[0-31] Position */
#define IP1553_TXBSR_TF1_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF1_Pos)              /* (IP1553_TXBSR) Transmit buffer 1, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF1(value)               (IP1553_TXBSR_TF1_Msk & (_UINT32_(value) << IP1553_TXBSR_TF1_Pos)) /* Assigment of value for TF1 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF2_Pos                  _UINT32_(2)                                          /* (IP1553_TXBSR) Transmit buffer 2, x with x=[0-31] Position */
#define IP1553_TXBSR_TF2_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF2_Pos)              /* (IP1553_TXBSR) Transmit buffer 2, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF2(value)               (IP1553_TXBSR_TF2_Msk & (_UINT32_(value) << IP1553_TXBSR_TF2_Pos)) /* Assigment of value for TF2 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF3_Pos                  _UINT32_(3)                                          /* (IP1553_TXBSR) Transmit buffer 3, x with x=[0-31] Position */
#define IP1553_TXBSR_TF3_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF3_Pos)              /* (IP1553_TXBSR) Transmit buffer 3, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF3(value)               (IP1553_TXBSR_TF3_Msk & (_UINT32_(value) << IP1553_TXBSR_TF3_Pos)) /* Assigment of value for TF3 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF4_Pos                  _UINT32_(4)                                          /* (IP1553_TXBSR) Transmit buffer 4, x with x=[0-31] Position */
#define IP1553_TXBSR_TF4_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF4_Pos)              /* (IP1553_TXBSR) Transmit buffer 4, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF4(value)               (IP1553_TXBSR_TF4_Msk & (_UINT32_(value) << IP1553_TXBSR_TF4_Pos)) /* Assigment of value for TF4 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF5_Pos                  _UINT32_(5)                                          /* (IP1553_TXBSR) Transmit buffer 5, x with x=[0-31] Position */
#define IP1553_TXBSR_TF5_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF5_Pos)              /* (IP1553_TXBSR) Transmit buffer 5, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF5(value)               (IP1553_TXBSR_TF5_Msk & (_UINT32_(value) << IP1553_TXBSR_TF5_Pos)) /* Assigment of value for TF5 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF6_Pos                  _UINT32_(6)                                          /* (IP1553_TXBSR) Transmit buffer 6, x with x=[0-31] Position */
#define IP1553_TXBSR_TF6_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF6_Pos)              /* (IP1553_TXBSR) Transmit buffer 6, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF6(value)               (IP1553_TXBSR_TF6_Msk & (_UINT32_(value) << IP1553_TXBSR_TF6_Pos)) /* Assigment of value for TF6 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF7_Pos                  _UINT32_(7)                                          /* (IP1553_TXBSR) Transmit buffer 7, x with x=[0-31] Position */
#define IP1553_TXBSR_TF7_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF7_Pos)              /* (IP1553_TXBSR) Transmit buffer 7, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF7(value)               (IP1553_TXBSR_TF7_Msk & (_UINT32_(value) << IP1553_TXBSR_TF7_Pos)) /* Assigment of value for TF7 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF8_Pos                  _UINT32_(8)                                          /* (IP1553_TXBSR) Transmit buffer 8, x with x=[0-31] Position */
#define IP1553_TXBSR_TF8_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF8_Pos)              /* (IP1553_TXBSR) Transmit buffer 8, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF8(value)               (IP1553_TXBSR_TF8_Msk & (_UINT32_(value) << IP1553_TXBSR_TF8_Pos)) /* Assigment of value for TF8 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF9_Pos                  _UINT32_(9)                                          /* (IP1553_TXBSR) Transmit buffer 9, x with x=[0-31] Position */
#define IP1553_TXBSR_TF9_Msk                  (_UINT32_(0x1) << IP1553_TXBSR_TF9_Pos)              /* (IP1553_TXBSR) Transmit buffer 9, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF9(value)               (IP1553_TXBSR_TF9_Msk & (_UINT32_(value) << IP1553_TXBSR_TF9_Pos)) /* Assigment of value for TF9 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF10_Pos                 _UINT32_(10)                                         /* (IP1553_TXBSR) Transmit buffer 10, x with x=[0-31] Position */
#define IP1553_TXBSR_TF10_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF10_Pos)             /* (IP1553_TXBSR) Transmit buffer 10, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF10(value)              (IP1553_TXBSR_TF10_Msk & (_UINT32_(value) << IP1553_TXBSR_TF10_Pos)) /* Assigment of value for TF10 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF11_Pos                 _UINT32_(11)                                         /* (IP1553_TXBSR) Transmit buffer 11, x with x=[0-31] Position */
#define IP1553_TXBSR_TF11_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF11_Pos)             /* (IP1553_TXBSR) Transmit buffer 11, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF11(value)              (IP1553_TXBSR_TF11_Msk & (_UINT32_(value) << IP1553_TXBSR_TF11_Pos)) /* Assigment of value for TF11 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF12_Pos                 _UINT32_(12)                                         /* (IP1553_TXBSR) Transmit buffer 12, x with x=[0-31] Position */
#define IP1553_TXBSR_TF12_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF12_Pos)             /* (IP1553_TXBSR) Transmit buffer 12, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF12(value)              (IP1553_TXBSR_TF12_Msk & (_UINT32_(value) << IP1553_TXBSR_TF12_Pos)) /* Assigment of value for TF12 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF13_Pos                 _UINT32_(13)                                         /* (IP1553_TXBSR) Transmit buffer 13, x with x=[0-31] Position */
#define IP1553_TXBSR_TF13_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF13_Pos)             /* (IP1553_TXBSR) Transmit buffer 13, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF13(value)              (IP1553_TXBSR_TF13_Msk & (_UINT32_(value) << IP1553_TXBSR_TF13_Pos)) /* Assigment of value for TF13 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF14_Pos                 _UINT32_(14)                                         /* (IP1553_TXBSR) Transmit buffer 14, x with x=[0-31] Position */
#define IP1553_TXBSR_TF14_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF14_Pos)             /* (IP1553_TXBSR) Transmit buffer 14, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF14(value)              (IP1553_TXBSR_TF14_Msk & (_UINT32_(value) << IP1553_TXBSR_TF14_Pos)) /* Assigment of value for TF14 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF15_Pos                 _UINT32_(15)                                         /* (IP1553_TXBSR) Transmit buffer 15, x with x=[0-31] Position */
#define IP1553_TXBSR_TF15_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF15_Pos)             /* (IP1553_TXBSR) Transmit buffer 15, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF15(value)              (IP1553_TXBSR_TF15_Msk & (_UINT32_(value) << IP1553_TXBSR_TF15_Pos)) /* Assigment of value for TF15 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF16_Pos                 _UINT32_(16)                                         /* (IP1553_TXBSR) Transmit buffer 16, x with x=[0-31] Position */
#define IP1553_TXBSR_TF16_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF16_Pos)             /* (IP1553_TXBSR) Transmit buffer 16, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF16(value)              (IP1553_TXBSR_TF16_Msk & (_UINT32_(value) << IP1553_TXBSR_TF16_Pos)) /* Assigment of value for TF16 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF17_Pos                 _UINT32_(17)                                         /* (IP1553_TXBSR) Transmit buffer 17, x with x=[0-31] Position */
#define IP1553_TXBSR_TF17_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF17_Pos)             /* (IP1553_TXBSR) Transmit buffer 17, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF17(value)              (IP1553_TXBSR_TF17_Msk & (_UINT32_(value) << IP1553_TXBSR_TF17_Pos)) /* Assigment of value for TF17 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF18_Pos                 _UINT32_(18)                                         /* (IP1553_TXBSR) Transmit buffer 18, x with x=[0-31] Position */
#define IP1553_TXBSR_TF18_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF18_Pos)             /* (IP1553_TXBSR) Transmit buffer 18, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF18(value)              (IP1553_TXBSR_TF18_Msk & (_UINT32_(value) << IP1553_TXBSR_TF18_Pos)) /* Assigment of value for TF18 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF19_Pos                 _UINT32_(19)                                         /* (IP1553_TXBSR) Transmit buffer 19, x with x=[0-31] Position */
#define IP1553_TXBSR_TF19_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF19_Pos)             /* (IP1553_TXBSR) Transmit buffer 19, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF19(value)              (IP1553_TXBSR_TF19_Msk & (_UINT32_(value) << IP1553_TXBSR_TF19_Pos)) /* Assigment of value for TF19 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF20_Pos                 _UINT32_(20)                                         /* (IP1553_TXBSR) Transmit buffer 20, x with x=[0-31] Position */
#define IP1553_TXBSR_TF20_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF20_Pos)             /* (IP1553_TXBSR) Transmit buffer 20, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF20(value)              (IP1553_TXBSR_TF20_Msk & (_UINT32_(value) << IP1553_TXBSR_TF20_Pos)) /* Assigment of value for TF20 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF21_Pos                 _UINT32_(21)                                         /* (IP1553_TXBSR) Transmit buffer 21, x with x=[0-31] Position */
#define IP1553_TXBSR_TF21_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF21_Pos)             /* (IP1553_TXBSR) Transmit buffer 21, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF21(value)              (IP1553_TXBSR_TF21_Msk & (_UINT32_(value) << IP1553_TXBSR_TF21_Pos)) /* Assigment of value for TF21 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF22_Pos                 _UINT32_(22)                                         /* (IP1553_TXBSR) Transmit buffer 22, x with x=[0-31] Position */
#define IP1553_TXBSR_TF22_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF22_Pos)             /* (IP1553_TXBSR) Transmit buffer 22, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF22(value)              (IP1553_TXBSR_TF22_Msk & (_UINT32_(value) << IP1553_TXBSR_TF22_Pos)) /* Assigment of value for TF22 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF23_Pos                 _UINT32_(23)                                         /* (IP1553_TXBSR) Transmit buffer 23, x with x=[0-31] Position */
#define IP1553_TXBSR_TF23_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF23_Pos)             /* (IP1553_TXBSR) Transmit buffer 23, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF23(value)              (IP1553_TXBSR_TF23_Msk & (_UINT32_(value) << IP1553_TXBSR_TF23_Pos)) /* Assigment of value for TF23 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF24_Pos                 _UINT32_(24)                                         /* (IP1553_TXBSR) Transmit buffer 24, x with x=[0-31] Position */
#define IP1553_TXBSR_TF24_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF24_Pos)             /* (IP1553_TXBSR) Transmit buffer 24, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF24(value)              (IP1553_TXBSR_TF24_Msk & (_UINT32_(value) << IP1553_TXBSR_TF24_Pos)) /* Assigment of value for TF24 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF25_Pos                 _UINT32_(25)                                         /* (IP1553_TXBSR) Transmit buffer 25, x with x=[0-31] Position */
#define IP1553_TXBSR_TF25_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF25_Pos)             /* (IP1553_TXBSR) Transmit buffer 25, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF25(value)              (IP1553_TXBSR_TF25_Msk & (_UINT32_(value) << IP1553_TXBSR_TF25_Pos)) /* Assigment of value for TF25 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF26_Pos                 _UINT32_(26)                                         /* (IP1553_TXBSR) Transmit buffer 26, x with x=[0-31] Position */
#define IP1553_TXBSR_TF26_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF26_Pos)             /* (IP1553_TXBSR) Transmit buffer 26, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF26(value)              (IP1553_TXBSR_TF26_Msk & (_UINT32_(value) << IP1553_TXBSR_TF26_Pos)) /* Assigment of value for TF26 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF27_Pos                 _UINT32_(27)                                         /* (IP1553_TXBSR) Transmit buffer 27, x with x=[0-31] Position */
#define IP1553_TXBSR_TF27_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF27_Pos)             /* (IP1553_TXBSR) Transmit buffer 27, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF27(value)              (IP1553_TXBSR_TF27_Msk & (_UINT32_(value) << IP1553_TXBSR_TF27_Pos)) /* Assigment of value for TF27 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF28_Pos                 _UINT32_(28)                                         /* (IP1553_TXBSR) Transmit buffer 28, x with x=[0-31] Position */
#define IP1553_TXBSR_TF28_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF28_Pos)             /* (IP1553_TXBSR) Transmit buffer 28, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF28(value)              (IP1553_TXBSR_TF28_Msk & (_UINT32_(value) << IP1553_TXBSR_TF28_Pos)) /* Assigment of value for TF28 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF29_Pos                 _UINT32_(29)                                         /* (IP1553_TXBSR) Transmit buffer 29, x with x=[0-31] Position */
#define IP1553_TXBSR_TF29_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF29_Pos)             /* (IP1553_TXBSR) Transmit buffer 29, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF29(value)              (IP1553_TXBSR_TF29_Msk & (_UINT32_(value) << IP1553_TXBSR_TF29_Pos)) /* Assigment of value for TF29 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF30_Pos                 _UINT32_(30)                                         /* (IP1553_TXBSR) Transmit buffer 30, x with x=[0-31] Position */
#define IP1553_TXBSR_TF30_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF30_Pos)             /* (IP1553_TXBSR) Transmit buffer 30, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF30(value)              (IP1553_TXBSR_TF30_Msk & (_UINT32_(value) << IP1553_TXBSR_TF30_Pos)) /* Assigment of value for TF30 in the IP1553_TXBSR register */
#define IP1553_TXBSR_TF31_Pos                 _UINT32_(31)                                         /* (IP1553_TXBSR) Transmit buffer 31, x with x=[0-31] Position */
#define IP1553_TXBSR_TF31_Msk                 (_UINT32_(0x1) << IP1553_TXBSR_TF31_Pos)             /* (IP1553_TXBSR) Transmit buffer 31, x with x=[0-31] Mask */
#define IP1553_TXBSR_TF31(value)              (IP1553_TXBSR_TF31_Msk & (_UINT32_(value) << IP1553_TXBSR_TF31_Pos)) /* Assigment of value for TF31 in the IP1553_TXBSR register */
#define IP1553_TXBSR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (IP1553_TXBSR) Register Mask  */

#define IP1553_TXBSR_TF_Pos                   _UINT32_(0)                                          /* (IP1553_TXBSR Position) Transmit buffer 3x, x with x=[x-3x] */
#define IP1553_TXBSR_TF_Msk                   (_UINT32_(0xFFFFFFFF) << IP1553_TXBSR_TF_Pos)        /* (IP1553_TXBSR Mask) TF */
#define IP1553_TXBSR_TF(value)                (IP1553_TXBSR_TF_Msk & (_UINT32_(value) << IP1553_TXBSR_TF_Pos)) 

